# 02. 그룹분석
그룹분석이란 "학년별", "국어평균" 과같이 데이터를 집단별로 나누어 그룹함수를 적용한 분석방법
ex) 지역별 인구수

In [1]:
from pandas import DataFrame
from pandas import read_csv
from matplotlib import pyplot
from pandas import merge
import numpy

In [2]:
df = read_csv('grade.csv', encoding="euc-kr")
df

   이름  학년  성별   국어    영어    수학    과학
0  철수   1  남자   98   NaN  88.0  64.0
1  영희   2  여자   88  90.0  62.0  72.0
2  민수   1  남자   92  70.0   NaN   NaN
3  수현   3  여자   63  60.0  31.0  70.0
4  호영   4  남자  120  50.0   NaN  88.0

In [3]:
이름 =list(df['이름'])
dic= {}
for i,v in enumerate(이름):
    dic[i] = v

df.rename(index=dic, inplace=True)
df.drop(['이름'], axis=1, inplace=True)
df

    학년  성별   국어    영어    수학    과학
철수   1  남자   98   NaN  88.0  64.0
영희   2  여자   88  90.0  62.0  72.0
민수   1  남자   92  70.0   NaN   NaN
수현   3  여자   63  60.0  31.0  70.0
호영   4  남자  120  50.0   NaN  88.0

In [4]:
df['국어'].max()

120

In [5]:
df.sum(axis=1, numeric_only=True)

철수    251.0
영희    314.0
민수    163.0
수현    227.0
호영    262.0
dtype: float64

In [6]:
p1 = df.filter(['국어','영어','수학','과학'])

In [8]:
p1_avg = p1.loc["영희"].mean()
p1_avg

78.0

In [9]:
p2 = df.filter(['국어','영어','수학','과학'])
p2_avg = p2.loc["민수"].mean()
p2_avg

81.0

In [11]:
df2= df.filter(['국어','영어','수학','과학'])
df2

     국어    영어    수학    과학
철수   98   NaN  88.0  64.0
영희   88  90.0  62.0  72.0
민수   92  70.0   NaN   NaN
수현   63  60.0  31.0  70.0
호영  120  50.0   NaN  88.0